<template>
  <div class="container">
    <h1>《有事通商务信息咨询服务部用户服务协议》</h1>
    （以下简称“本协议”）是由有事通商务信息咨询服务部网站的用户（以下简称“用户或您”）与有事通商务信息咨询服务部网站的运营方之间，就网站平台服务等相关事宜共同缔结。本协议具有合同效力，您应当阅读并遵守本协议。请您务必审慎阅读、充分理解各条款内容。<br>
一、协议确认：

您同意并点击确认本协议条款且完成注册程序后，才能成为有事通商务信息咨询服务部的正式注册用户，并享受有事通商务信息咨询服务部的各类服务。
在您完成用户注册程序后，即表示您自愿接受本协议，正式成为有事通商务信息咨询服务部的注册用户，并认可本协议全部条款内容。若您不同意本协议，或对本协议中的条款存在任何疑问，请您立即停止有事通商务信息咨询服务部用户注册程序，并可以选择不使用本网站服务。
您点击同意本协议后，即视为您确认自己具有享受有事通商务信息咨询服务部服务、进行交易等相应的权利能力和行为能力，能够独立承担法律责任。<br>
二、账户管理：

在您签署本协议，完成注册程序时，有事通商务信息咨询服务部会向您提供唯一编号的有事通商务信息咨询服务部账户。您应对您的用户账号、登录密码的安全，以及对通过您的账户和密码实施的行为负责；如因您的个人原因所导致的任何损失或损害，有事通商务信息咨询服务部无法也不承担任何责任。除非有法律规定或行政司法机关的指令，且征得有事通商务信息咨询服务部的同意，否则您的用户账户、登录密码不得以任何方式转让、借用、赠与或继承（与账户相关的财产权益除外）。否则，由此给您（或有事通商务信息咨询服务部、任何第三方）造成的一切损失，一律由您自行承担。请您对密码加以妥善保管，切勿将密码告知他人，因密码保管不善而造成的所有损失由您自行承担。
当发现任何人不当使用您的账号或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式通知有事通商务信息咨询服务部，要求暂停相关服务。您理解有事通商务信息咨询服务部对您的请求采取行动需要合理时间，有事通商务信息咨询服务部对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
您在注册帐号或使用有事通商务信息咨询服务部平台服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写您的真实的身份信息。若您填写的信息不完整，则无法使用有事通商务信息咨询服务部平台服务或在使用过程中受到限制。
在下列情况下，有事通商务信息咨询服务部可以通过注销用户账号的方式单方解除本协议：
<br>1) 在用户违反本协议相关规定时，有事通商务信息咨询服务部有权暂停或终止向该用户提供服务。如该用户在有事通商务信息咨询服务部暂停或终止提供服务后，再一次直接或间接或以他人名义注册为有事通商务信息咨询服务部用户的，则有事通商务信息咨询服务部有权再次暂停或终止向该用户提供服务；
<br>2) 一经发现用户注册信息中的内容是虚假的，有事通商务信息咨询服务部即有权终止向该用户提供服务；
<br>3) 本协议修改或更新时，如用户表示不愿接受新的服务协议的，有事通商务信息咨询服务部有权终止向该用户提供服务；
<br>4) 遭遇不可抗力时，有事通商务信息咨询服务部有权单方面终止提供服务。
用户理解并同意，即便在本协议终止及用户的服务被终止后，有事通商务信息咨询服务部仍有权：
<br>1) 继续保存您的用户信息；
<br>2) 继续向用户主张在其使用有事通商务信息咨询服务部平台服务期间因违反法律法规、本协议及平台规则而应承担的责任。<br>
三、服务使用规范：

通过有事通商务信息咨询服务部服务平台，您可以按照有事通商务信息咨询服务部的规则发布各种生活信息。但所发布的信息不得含有以下内容：
<br>1) 反对宪法所确定的基本原则，煽动抗拒、破坏宪法和法律、行政法规实施的；
<br>2) 煽动危害国家安全、泄露国家秘密、颠覆国家政权，推翻社会主义制度的；
<br>3) 煽动分裂国家、破坏国家统一、损害国家荣誉和民族利益的；
<br>4) 煽动民族仇恨、民族歧视，破坏民族团结的；
<br>5) 捏造或者歪曲事实，散布谣言，扰乱社会秩序的；
<br>6) 进行政治宣传或破坏国家宗教政策、宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；
<br>7) 公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；
<br>8) 损害国家机关信誉的；
<br>9) 其他违反宪法和法律法规的；
在接受有事通商务信息咨询服务部服务的过程中，您不得从事下列行为：
<br>1) 发表、传送、传播、储存、侵害他人拥有知识产权、商业秘密权等合法权利的内容；包含病毒、木马等可能对有事通商务信息咨询服务部系统造成伤害或影响其稳定性的内容或制造虚假身份以误导、欺骗他人；
<br>2) 传送或散布或以其他方式实现传送的受到知识产权法律保护的文字、图像、相片、软件或其他资料的文件，作为举例（但不限于此）：包括著作权或商标权（或隐私权或公开权），除非用户已获得该知识产权权利人许可或授权；
<br>3) 使用任何包含有通过侵犯商标、著作权、专利、商业机密或任何一方的其他专有权利的方式利用本“软件”获得的图像或相片的资料或信息；
<br>4) 进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/帐号；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本平台系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称；
<br>5) 修改或伪造软件作品运行中的指令、数据、数据包，增加、删减、变动软件 的功能或运行效果，不得将用于上述用途的软件通过信息网络向公众传播或者运营；
<br>6) 在未经有事通商务信息咨询服务部书面明确授权前提下，出售、出租、出借、散布、转移或转授权软件和服务或相关的链接或从使用软件和服务或软件和服务的条款中获利，无论以上使用是否为直接经济或金钱收益；
<br>7) 违反有事通商务信息咨询服务部页面公布的活动规则，包括但不限于发布虚假信息、作弊或通过其他手段进行虚假交易。
您了解并同意，有事通商务信息咨询服务部有权应政府部门（包括司法及行政部门）的要求，向其提供您在有事通商务信息咨询服务部平台填写的注册信息和发布纪录等必要信息。
在使用有事通商务信息咨询服务部平台服务过程中，您承诺遵守以下约定：
<br>1) 在使用有事通商务信息咨询服务部平台服务过程中实施的所有行为均遵守国家法律、法规等规范文件及有事通商务信息咨询服务部平台各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，同时有事通商务信息咨询服务部保留向您追究法律责任的权利。
<br>2) 不发布国家禁止发布的信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的信息，不发布违背社会公共利益或公共道德、公序良俗的信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。
<br>3) 不对有事通商务信息咨询服务部平台上的任何数据作商业性利用，包括但不限于在未经有事通商务信息咨询服务部事先书面同意的情况下，以复制、传播等任何方式使用平台站上展示的资料。
您了解并同意以下条款：
<br>1) 您违反上述承诺时，有事通商务信息咨询服务部有权依据本协议的约定，做出相应处理或终止向您提供服务，且无须征得您的同意或提前通知于您。
<br>2) 根据相关法令的指定或者有事通商务信息咨询服务部服务规则的判断，您的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款的，有事通商务信息咨询服务部有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低您的信用值或直接停止提供服务。
<br>3) 对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任。
<br>4) 如您涉嫌违反有关法律或者本协议之规定，使有事通商务信息咨询服务部遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿有事通商务信息咨询服务部因此造成的损失及（或）发生的费用，包括合理的律师费及诉讼费用。<br>
四、平台信息内容

有事通商务信息咨询服务部仅向注册用户和非注册用户提供平台服务，有事通商务信息咨询服务部平台上的信息系用户自行发布，由于海量信息的存在及现有技术原因，有事通商务信息咨询服务部无法杜绝可能存在的风险和瑕疵。您应谨慎判断确定相关信息的真实性、合法性和有效性，并注意保留相应的证据以利于维权。如可能，尽量采用网站建议的交易方式进行。有事通商务信息咨询服务部不对信息的真实性，准确性，有效性和安全性负责。
鉴于互联网的特殊性，您同意在使用有事通商务信息咨询服务部平台服务过程中显示有事通商务信息咨询服务部自行或由第三方服务商向您发送的推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。如您有异议可与有事通商务信息咨询服务部协商解决或停止使用有事通商务信息咨询服务部提供的服务，除法律法规明确规定外，您应自行对依该推广信息进行的交易负责，对用户因依该推广信息进行的交易或前述第三方服务商提供的内容而遭受的损失或损害，有事通商务信息咨询服务部不承担任何责任。
有事通商务信息咨询服务部对下列不可抗力行为免责：信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令等而造成的不能服务或延迟服务。
为了使您的信息能够得到更好的服务效果，有事通商务信息咨询服务部可能会有选择性的将您发布的信息在第三方平台（包括但不限于微博、微信、论坛、公众号等）进行再次推广，您对此表示理解和接受。如您对该推广行为有异议时，可联系有事通商务信息咨询服务部。
您应当严格遵守本协议及有事通商务信息咨询服务部发布的其他协议、活动规则，因您违反协议或规则的行为给第三方或有事通商务信息咨询服务部造成损失的，您应当承担全部责任。
平台所有信息都是公开的。<br>
五、费用与服务

有事通商务信息咨询服务部对于公益事业信息免费提供服务，但针对有事通商务信息咨询服务部的特定服务收费。若用户所使用的服务需支付费用，用户有权决定是否使用并接受该收费服务。有事通商务信息咨询服务部上的收费服务以人民币计价，定价上可能随时调整。我们将以网站公告的方式，来通知用户收费政策的变更。有事通商务信息咨询服务部也可选择在促销或新服务推出时，暂时调整我们的服务收费，该调整于我们公布促销或新服务时开始生效。付费服务是在系统接收到用户的付款后才开始。若因个人行为（如:自行删除）或发布信息内容违反有事通商务信息咨询服务部公约（公约以付费实际发生时的公约为准）而被转移类目或被删除，有事通商务信息咨询服务部将不予退款。
有事通商务信息咨询服务部因网站自身需要进行改版的，若涉及付费产品的实质性变化，包括但不限于产品取消、服务内容发生增加或减少、登载页面变更、发布城市变更的，有事通商务信息咨询服务部有权提前单方终止服务并及时通知客户，将客户已付款但未履行服务部分款项退还客户，此类情况不视为有事通商务信息咨询服务部违约。<br>
六、侵权通知

当您发现有事通商务信息咨询服务部上的任何内容不符合法律规定，不符合本协议规定，或不符合有事通商务信息咨询服务部公约的规定时，您有权利和义务通过点击“举报”链接向有事通商务信息咨询服务部汇报。 当您确认自己的个人信息被盗用，或者您的版权或者其他权利被侵害，请将此情况报告给有事通商务信息咨询服务部。我们接受在线提交举报。同时提供如下信息和材料：
<br>1) 侵犯您权利的信息的网址，编号或其他可以找到该信息的细节；
<br>2) 您是所述的版权或者其他权利的合法拥有者的权利证明；
<br>3) 您的联系方式，包括联系人姓名，地址，电话号码和电子邮件；
<br>4) 您的身份证复印件、营业执照等其他相关资料。
经审查得到证实的，我们将及时删除相关信息。我们仅接受邮寄、电子邮件或传真方式的书面侵权通知。情况紧急的，您可以通过客服电话先行告知，我们会视情况采取相应措施。<br>
七、隐私保护

有事通商务信息咨询服务部有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。<br>

八、知识产权

用户保证和声明对其所提供的文本、图片、图形、音频和/或视频等信息/作品拥有完整的合法的著作权或完整的合法的授权可以用于其在有事通商务信息咨询服务部上从事的活动，保证有事通商务信息咨询服务部使用该内容不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户应对其所提供信息因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。
有事通商务信息咨询服务部保留对其网站所有内容进行实时监控的权利，并有权依其独立判断对任何违反本协议约定的作品、内容、信息实施删除。有事通商务信息咨询服务部对于删除用户作品、内容、信息引起的任何后果或导致用户的任何损失不负任何责任。
因用户提交的作品、内容、信息的违法或侵害第三人的合法权益而导致有事通商务信息咨询服务部或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于有事通商务信息咨询服务部或其关联公司蒙受的上述损失承担全面的赔偿责任。
用户同意许可有事通商务信息咨询服务部对其创作发布的作品享有无偿合法使用的权利，用户理解并确认该等使用不构成对其作品的任何侵权。<br>
九、法律适用与管辖

本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律，如法律无相关规定的，则应参照通用国际商业惯例或行业惯例。
因本协议产生之争议、纠纷，应由有事通商务信息咨询服务部与您友好协商解决；协商不成的，应依照中华人民共和国法律予以处理，并应以榕城区人民法院作为管辖法院提起诉讼。<br>
十、协议的修改和通知

如遇国家法律法规变更或有事通商务信息咨询服务部产品和服务规则发生调整，有事通商务信息咨询服务部有权根据需要不时地修改本协议，并以在网站公示的方式进行通知；如用户不同意相关变更内容，请停止使用有事通商务信息咨询服务部服务。如果用户继续享用服务，则视为无条件接受本协议条款的变动。<br>
十一、其他

本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
本协议自2018年11月11日起执行。<br>

  </div>
</template>

<script>
import card from '@/components/card'
import { mapState } from 'vuex'

export default {
  data() {
    return {
    }
  },
  components: {
    card
  },
  computed: {
    ...mapState(['code', 'text'])
  },
  mounted() {
    console.log('code', this.code)
    console.log('text', this.text)
  },
  methods: {
    onChange(event) {
      wx.showToast({
        icon: 'none',
        title: `切换至第${event.mp.detail}项`
      });
    },
    goTo: function (url) {
      console.log(url)
      wx.navigateTo({
        url: url
      })
    },
  }
}
</script>

<style lang="scss">
@import "./style.scss";
</style>
